ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
  tft.setTextWrap(true);

  tft.setTextColor(headingColor, ILI9341_BLACK);
  tft.setTextSize(3);
  tft.setCursor(20, 25);
  tft.println(heading);

  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(2);

  if (line1.length() > 0) {
    tft.setCursor(20, 95);
    tft.println(line1);
  }

  if (line2.length() > 0) {
    tft.setTextColor(ILI9341_GREEN, ILI9341_BLACK);
    tft.setCursor(20, 155);
    tft.println(line2);
  }
}

bool displayStoredImage() {
  if (!imageStorageReady || !FFat.exists(IMAGE_PATH)) return false;

  File imageFile = FFat.open(IMAGE_PATH, FILE_READ);
  if (!imageFile || imageFile.size() != IMAGE_SIZE) {
    Serial.printf("Cached image invalid: %d bytes\n", imageFile ? imageFile.size() : -1);
    if (imageFile) imageFile.close();
    return false;
  }

  Serial.printf("Rendering cached image: %d bytes\n", imageFile.size());
  tft.setAddrWindow(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT);
  tft.startWrite();

  const int CHUNK_PIXELS = 512;
  uint16_t pixels[CHUNK_PIXELS];
  int remaining = IMAGE_SIZE;

  while (remaining > 0) {
    int bytesRead = imageFile.read(reinterpret_cast<uint8_t*>(pixels), min(remaining, CHUNK_PIXELS * 2));
    if (bytesRead <= 0 || bytesRead % 2 != 0) break;

    tft.writePixels(pixels, bytesRead / 2, true);
    remaining -= bytesRead;
  }

  tft.endWrite();
  imageFile.close();
  return remaining == 0;
}

void configModeCallback(WiFiManager* wifiManager) {
  Serial.println("Wi-Fi setup portal started");

  String apName = wifiManager->getConfigPortalSSID();

  showScreen(
    "WI-FI SETUP",
    "Connect phone to:",
    apName,
    ILI9341_YELLOW
  );

  Serial.print("Setup network: ");
  Serial.println(apName);
  Serial.println("Open http://192.168.4.1 if portal does not open");
}

void saveConfigCallback() {
  Serial.println("New Wi-Fi credentials saved");

  showScreen(
    "SAVED!",
    "Wi-Fi details stored",
    "Restarting..."
  );
}

// ---------------------------------------------------------------------------
// Touch overlay helpers
// ---------------------------------------------------------------------------
int mapTouchToScreenX(int rawX) {
  return constrain(map(rawX, RAW_X_MIN, RAW_X_MAX, 0, SCREEN_WIDTH - 1), 0, SCREEN_WIDTH - 1);
}

int mapTouchToScreenY(int rawY) {
  return constrain(map(rawY, RAW_Y_MIN, RAW_Y_MAX, 0, SCREEN_HEIGHT - 1), 0, SCREEN_HEIGHT - 1);
}

bool isInButton(int x, int y, const Button& btn) {
  return x >= btn.x && x < btn.x + btn.w && y >= btn.y && y < btn.y + btn.h;
}

bool isInAnyControl(int x, int y) {
  if (isInButton(x, y, heartBtn)) return true;
  if (!toolbarVisible) {
    if (isInButton(x, y, penBtn)) return true;
  } else {
    if (isInButton(x, y, drawBtn)) return true;
    if (isInButton(x, y, clearBtn)) return true;
    if (isInButton(x, y, sendBtn)) return true;
    if (isInButton(x, y, closeBtn)) return true;
  }
  return false;
}

bool getOverlayPixel(int x, int y) {
  if (x < 0 || x >= SCREEN_WIDTH || y < 0 || y >= SCREEN_HEIGHT) return false;
  int idx = y * SCREEN_WIDTH + x;
  return overlayBuffer[idx >> 3] & (1 << (idx & 7));
}

void setOverlayPixel(int x, int y) {
  if (x < 0 || x >= SCREEN_WIDTH || y < 0 || y >= SCREEN_HEIGHT) return;
  int idx = y * SCREEN_WIDTH + x;
  int byteIdx = idx >> 3;
  uint8_t bit = 1 << (idx & 7);
  if (overlayBuffer[byteIdx] & bit) return;
  overlayBuffer[byteIdx] |= bit;
  tft.drawPixel(x, y, TFT_WHITE);
}

void clearOverlay() {
  memset(overlayBuffer, 0, sizeof(overlayBuffer));
}

void drawLine(int x0, int y0, int x1, int y1) {
  int dx = abs(x1 - x0), sx = x0 < x1 ? 1 : -1;
  int dy = -abs(y1 - y0), sy = y0 < y1 ? 1 : -1;
  int err = dx + dy;

  tft.startWrite();
  while (true) {
    setOverlayPixel(x0, y0);
    if (x0 == x1 && y0 == y1) break;
    int e2 = 2 * err;
    if (e2 >= dy) { err += dy; x0 += sx; }
    if (e2 <= dx) { err += dx; y0 += sy; }
  }
  tft.endWrite();
}

void resetFeedbackState() {
  clearOverlay();
  toolbarVisible = false;
  drawModeActive = false;
}

// ---------------------------------------------------------------------------
// UI rendering
// ---------------------------------------------------------------------------
void drawButton(const Button& btn, uint16_t color, const char* label) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 4, color);
  tft.setTextColor(ILI9341_WHITE, color);
  tft.setTextSize(1);
  int16_t textWidth = strlen(label) * 6;
  tft.setCursor(btn.x + (btn.w - textWidth) / 2, btn.y + (btn.h - 8) / 2);
  tft.print(label);
}

void drawHeartButton(const Button& btn) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 4, ILI9341_RED);
  int cx = btn.x + btn.w / 2;
  int cy = btn.y + btn.h / 2 - 1;
  tft.fillCircle(cx - 8, cy - 4, 7, ILI9341_WHITE);
  tft.fillCircle(cx + 8, cy - 4, 7, ILI9341_WHITE);
  tft.fillTriangle(cx - 15, cy - 2, cx + 15, cy - 2, cx, cy + 14, ILI9341_WHITE);
}

void drawCloseButton(const Button& btn) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 4, ILI9341_RED);
  int inset = 13;
  tft.drawLine(btn.x + inset, btn.y + inset - 1, btn.x + btn.w - inset, btn.y + btn.h - inset + 1, ILI9341_WHITE);
  tft.drawLine(btn.x + inset, btn.y + inset, btn.x + btn.w - inset, btn.y + btn.h - inset + 2, ILI9341_WHITE);
  tft.drawLine(btn.x + btn.w - inset, btn.y + inset - 1, btn.x + inset, btn.y + btn.h - inset + 1, ILI9341_WHITE);
  tft.drawLine(btn.x + btn.w - inset, btn.y + inset, btn.x + inset, btn.y + btn.h - inset + 2, ILI9341_WHITE);
}

void renderUI() {
  drawHeartButton(heartBtn);

  if (!toolbarVisible) {
    drawButton(penBtn, ILI9341_BLUE, "PEN");
  } else {
    tft.fillRect(0, TOOLBAR_Y, SCREEN_WIDTH, TOOLBAR_H, ILI9341_BLACK);
    drawButton(drawBtn, drawModeActive ? ILI9341_GREEN : ILI9341_BLUE, "DRAW");
    drawButton(clearBtn, ILI9341_YELLOW, "CLR");
    drawButton(sendBtn, ILI9341_PINK, "SEND");
    drawCloseButton(closeBtn);
  }
}

void renderScreen() {
  displayStoredImage();
  displayCaption();
  renderUI();
}

void flashButton(const Button& btn) {
  tft.drawRect(btn.x - 2, btn.y - 2, btn.w + 4, btn.h + 4, ILI9341_WHITE);
  delay(120);
  renderUI();
}

void displayCaption() {
  if (currentCaption.length() == 0) return;
  const int capY = 42;
  const int capH = 22;
  tft.fillRect(0, capY, SCREEN_WIDTH, capH, ILI9341_BLACK);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(1);
  tft.setTextWrap(true);
  tft.setCursor(5, capY + 4);
  tft.print(currentCaption);
}

void showToast(const String& text) {
  toastText = text;
  toastUntil = millis() + 1500;
  tft.fillRect(60, 100, 200, 40, ILI9341_BLACK);
  tft.drawRect(60, 100, 200, 40, ILI9341_WHITE);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(2);
  tft.setCursor(80, 113);
  tft.print(text);
}

void clearToast() {
  if (toastUntil > 0 && millis() > toastUntil) {
    toastUntil = 0;
    renderScreen();
  }
}

// ---------------------------------------------------------------------------
// Touch handling
// ---------------------------------------------------------------------------
void handleTouch() {
  if (!touchReady) return;

  TS_Point p = touch.getPoint();
  bool isTouched = touch.touched();

