ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
  if (!wasTouched && isTouched) {
    touchStartX = mapTouchToScreenX(p.x);
    touchStartY = mapTouchToScreenY(p.y);
    touchLastX = touchStartX;
    touchLastY = touchStartY;
    touchMoved = false;
    Serial.printf("touch down: raw=%d,%d screen=%d,%d z=%d\n", p.x, p.y, touchStartX, touchStartY, p.z);
  } else if (wasTouched && isTouched) {
    int x = mapTouchToScreenX(p.x);
    int y = mapTouchToScreenY(p.y);
    if (abs(x - touchStartX) > 5 || abs(y - touchStartY) > 5) touchMoved = true;

    if (drawModeActive && !isInAnyControl(x, y)) {
      drawLine(touchLastX, touchLastY, x, y);
    }
    touchLastX = x;
    touchLastY = y;
  } else if (wasTouched && !isTouched) {
    Serial.printf("touch up: screen=%d,%d moved=%s\n", touchStartX, touchStartY, touchMoved ? "yes" : "no");
    if (!touchMoved) {
      handleTap(touchStartX, touchStartY);
    }
  }
  wasTouched = isTouched;
}

void handleTap(int x, int y) {
  if (isInButton(x, y, heartBtn)) {
    Serial.println("tap: heart");
    flashButton(heartBtn);
    if (sendLikeFeedback()) {
      showToast("Liked!");
    } else {
      showToast("Like failed");
    }
    return;
  }

  if (toolbarVisible) {
    if (isInButton(x, y, drawBtn)) {
      Serial.println("tap: draw");
      flashButton(drawBtn);
      drawModeActive = !drawModeActive;
      renderUI();
    } else if (isInButton(x, y, clearBtn)) {
      Serial.println("tap: clear");
      flashButton(clearBtn);
      clearOverlay();
      renderScreen();
    } else if (isInButton(x, y, sendBtn)) {
      Serial.println("tap: send");
      flashButton(sendBtn);
      bool ok = sendDrawingFeedback();
      resetFeedbackState();
      renderScreen();
      showToast(ok ? "Sent!" : "Send failed");
    } else if (isInButton(x, y, closeBtn)) {
      Serial.println("tap: close");
      flashButton(closeBtn);
      drawModeActive = false;
      toolbarVisible = false;
      renderScreen();
    }
  } else {
    if (isInButton(x, y, penBtn)) {
      Serial.println("tap: pen");
      flashButton(penBtn);
      toolbarVisible = true;
      renderUI();
    }
  }
}

// ---------------------------------------------------------------------------
// Network feedback
// ---------------------------------------------------------------------------
bool sendLikeFeedback() {
  if (lastProcessedId.length() == 0) {
    Serial.println("like feedback: no message id");
    return false;
  }

  String url = String(API_HOST) + "/.netlify/functions/lovebox-feedback?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Feedback-Type", "like");
  http.setTimeout(HTTP_TIMEOUT_MS);

  String payload = "{\"type\":\"like\",\"messageId\":\"" + lastProcessedId + "\"}";
  int httpCode = http.POST(payload);
  http.end();

  Serial.printf("like feedback HTTP %d, id=%s\\n", httpCode, lastProcessedId.c_str());
  return httpCode == 200;
}

bool sendDrawingFeedback() {
  if (lastProcessedId.length() == 0 || !imageStorageReady || !FFat.exists(IMAGE_PATH)) {
    Serial.printf("draw feedback: not ready, id=%s, storage=%s, image=%s\n",
      lastProcessedId.c_str(),
      imageStorageReady ? "yes" : "no",
      FFat.exists(IMAGE_PATH) ? "yes" : "no");
    return false;
  }

  File imageFile = FFat.open(IMAGE_PATH, FILE_READ);
  if (!imageFile || imageFile.size() != IMAGE_SIZE) {
    if (imageFile) imageFile.close();
    return false;
  }

  uint8_t* composed = new uint8_t[IMAGE_SIZE];
  if (!composed) {
    imageFile.close();
    return false;
  }

  if (imageFile.read(composed, IMAGE_SIZE) != IMAGE_SIZE) {
    delete[] composed;
    imageFile.close();
    return false;
  }
  imageFile.close();

  for (int y = 0; y < SCREEN_HEIGHT; y++) {
    for (int x = 0; x < SCREEN_WIDTH; x++) {
      if (getOverlayPixel(x, y)) {
        int idx = (y * SCREEN_WIDTH + x) * 2;
        composed[idx] = 0xFF;
        composed[idx + 1] = 0xFF;
      }
    }
  }

  String url = String(API_HOST) + "/.netlify/functions/lovebox-feedback?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/octet-stream");
  http.addHeader("X-Feedback-Type", "draw");
  http.addHeader("X-Message-Id", lastProcessedId);
  http.setTimeout(HTTP_TIMEOUT_MS);

  int httpCode = http.sendRequest("POST", composed, IMAGE_SIZE);
  http.end();

  delete[] composed;
  Serial.printf("draw feedback HTTP %d, id=%s\n", httpCode, lastProcessedId.c_str());
  return httpCode == 200;
}

bool sendHealthReport() {
  if (WiFi.status() != WL_CONNECTED) return false;

  JsonDocument doc;
  doc["deviceId"] = DEVICE_ID;
  doc["firmwareVersion"] = FIRMWARE_VERSION;
  doc["uptimeMs"] = millis();
  doc["wifiRssi"] = WiFi.RSSI();
  doc["freeHeap"] = ESP.getFreeHeap();
  doc["psramTotal"] = ESP.getPsramSize();
  doc["psramFree"] = ESP.getFreePsram();
  doc["ffatMounted"] = imageStorageReady;
  doc["ffatTotal"] = imageStorageReady ? FFat.totalBytes() : 0;
  doc["ffatUsed"] = imageStorageReady ? FFat.usedBytes() : 0;
  doc["resetReason"] = static_cast<int>(esp_reset_reason());
  doc["lastSuccessfulCommunicationMs"] = lastSuccessfulCommunicationAt;
  doc["lastMessageId"] = lastProcessedId;
  doc["displayReady"] = displayReady;
  doc["touchReady"] = touchReady;
  doc["audioReady"] = false;
  doc["servoReady"] = servoReady;

  String payload;
  serializeJson(doc, payload);

  String url = String(API_HOST) + "/.netlify/functions/lovebox-health?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(HTTP_TIMEOUT_MS);
  int httpCode = http.POST(payload);
  http.end();

  Serial.printf("health HTTP %d, firmware=%s\n", httpCode, FIRMWARE_VERSION);
  return httpCode == 200;
}

int compareFirmwareVersions(const String& left, const String& right) {
  int leftMajor = 0, leftMinor = 0, leftPatch = 0;
  int rightMajor = 0, rightMinor = 0, rightPatch = 0;
  if (sscanf(left.c_str(), "%d.%d.%d", &leftMajor, &leftMinor, &leftPatch) != 3 ||
      sscanf(right.c_str(), "%d.%d.%d", &rightMajor, &rightMinor, &rightPatch) != 3) {
    return 0;
  }
  if (leftMajor != rightMajor) return leftMajor > rightMajor ? 1 : -1;
  if (leftMinor != rightMinor) return leftMinor > rightMinor ? 1 : -1;
  if (leftPatch != rightPatch) return leftPatch > rightPatch ? 1 : -1;
  return 0;
}

bool isSha256Hex(const String& value) {
  if (value.length() != 64) return false;
  for (size_t index = 0; index < value.length(); index++) {
    if (!isxdigit(value[index])) return false;
  }
  return true;
}

bool checkForFirmwareUpdate() {
  if (WiFi.status() != WL_CONNECTED) return false;

  String manifestUrl = String(API_HOST) + "/.netlify/functions/lovebox-firmware?deviceId=" + DEVICE_ID;
  http.begin(secureClient, manifestUrl);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(HTTP_TIMEOUT_MS);
  int httpCode = http.GET();
  if (httpCode != 200) {
    Serial.printf("firmware manifest HTTP %d\n", httpCode);
    http.end();
    return false;
  }

  String payload = http.getString();
  http.end();

  JsonDocument manifest;
  if (deserializeJson(manifest, payload) || !manifest["ok"].as<bool>()) {
    Serial.println("firmware manifest invalid");
    return false;
  }

  String version = manifest["data"]["version"].as<String>();
  String downloadUrl = manifest["data"]["url"].as<String>();
  String expectedSha256 = manifest["data"]["sha256"].as<String>();
  if (compareFirmwareVersions(version, FIRMWARE_VERSION) <= 0 ||
      !downloadUrl.startsWith("https://") || !isSha256Hex(expectedSha256)) {
    Serial.printf("no valid firmware update: version=%s\n", version.c_str());
    return false;
  }

  Serial.printf("firmware update available: %s -> %s\n", FIRMWARE_VERSION, version.c_str());
  http.begin(secureClient, downloadUrl);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(DOWNLOAD_TIMEOUT_MS);
  http.useHTTP10(false);
  httpCode = http.GET();
  int contentLength = http.getSize();
  if (httpCode != 200 || contentLength <= 0 || static_cast<size_t>(contentLength) > OTA_MAX_IMAGE_SIZE) {
    Serial.printf("firmware download rejected: HTTP %d, size=%d\n", httpCode, contentLength);
    http.end();
    return false;
  }

  if (!Update.begin(contentLength)) {
    Serial.printf("OTA begin failed: %s\n", Update.errorString());
    http.end();
    return false;
  }

